Revit 2026 API

# SubTransaction Class

---

Sub-transactions are objects that provide control over a subset of changes in a document.

SystemObject Autodesk.Revit.DBSubTransaction

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SubTransaction : IDisposable
```
```vb
Public Class SubTransaction
	Implements IDisposable
```
```cpp
public ref class SubTransaction : IDisposable
```
```fsharp
type SubTransaction =
    class
        interface IDisposable
    end
```

The SubTransaction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SubTransaction | Instantiates a sub-transaction object |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Commit | Commits all changes made to the model made during the sub-transaction. |
|  | Dispose | Releases all resources used by the SubTransaction |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetStatus | Returns the current status of the sub-transaction. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasEnded | Determines whether the sub-transaction has ended already. |
|  | HasStarted | Determines whether the sub-transaction has been started yet. |
|  | RollBack | Discards all changes made to the model during the sub-transaction. |
|  | Start | Starts the sub-transaction. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A Sub-transaction can only be active as a part of an open transaction. Sub-transactions may be nested inside each other, but with the restriction that every nested sub-transaction is entirely contained (opened and closed) in the parent sub-transaction.

If a sub-transaction was started and not committed or rolled back by the time the SubTransaction object is about to be disposed, the destructor will roll back the sub-transaction automatically, thus all changes made to the document during the sub-transaction will be discarded. It is not recommended to rely on this default behavior though. Instead, it is advised to always call either Commit or RollBack explicitly before the sub-transaction object gets disposed. Please note that unless invoked explicitly the actual destruction of an object in managed code might not happen until the object is collected by the garbage collector.

#### Reference

Autodesk.Revit.DB Namespace